MaJerle/stm32f429/00-STM32F429_LIBRARIES/fatfs/drivers/fatfs_sd_sdio.c
	if (status == SD_OK) {
		return RES_OK;
	}
	return RES_ERROR;
}

DRESULT TM_FATFS_SD_SDIO_disk_write(BYTE *buff, DWORD sector, UINT count) {
	SD_Error status = SD_OK;

	if (!TM_FATFS_SDIO_WriteEnabled()) {
		FATFS_DEBUG_SEND_USART("disk_write: Write protected!!! \n---------------------------------------------");
		return RES_WRPRT;
	}
	
	SD_WriteMultiBlocks((BYTE *)buff, sector << 9, 512, 1);

	/* Check if the Transfer is finished */
	status = SD_WaitWriteOperation();
	while(SD_GetStatus() != SD_TRANSFER_OK);     

	if (status == SD_OK) {
		return RES_OK;
	}
	return RES_ERROR;
}

DRESULT TM_FATFS_SD_SDIO_disk_ioctl(BYTE cmd, char *buff) {
	switch (cmd) {
		case GET_SECTOR_SIZE :     // Get R/W sector size (WORD) 
			*(WORD * )buff = 512;
		break;
		case GET_BLOCK_SIZE :      // Get erase block size in unit of sector (DWORD)
			*(DWORD * )buff = 32;
		break;
		case CTRL_SYNC :
		case CTRL_ERASE_SECTOR :
		break;
	}

	return RES_OK;
}

void SDIO_IRQHandler(void) {
	SD_ProcessIRQSrc();
}
#ifdef SD_SDIO_DMA_STREAM3
void DMA2_Stream3_IRQHandler(void) {
	SD_ProcessDMAIRQ();
}
#endif

#ifdef SD_SDIO_DMA_STREAM6
void DMA2_Stream6_IRQHandler(void) {
	SD_ProcessDMAIRQ();
}
#endif














/**
 * @}
 */

/** @defgroup STM324x9I_EVAL_SDIO_SD_Private_Functions
 * @{
 */

/**
 * @brief  DeInitializes the SDIO interface.
 * @param  None
 * @retval None
 */
void SD_DeInit (void)
{
        SD_LowLevel_DeInit ();
}

/**
 * @brief  Initializes the SD Card and put it into StandBy State (Ready for data
 *         transfer).
 * @param  None
 * @retval SD_Error: SD Card Error code.
 */
SD_Error SD_Init (void)
{
	__IO SD_Error errorstatus = SD_OK;

	/* SDIO Peripheral Low Level Init */
	//SD_LowLevel_Init();
	SDIO_DeInit ();
	errorstatus = SD_PowerON ();

	if (errorstatus != SD_OK) {
		logf ("SD_PowerON failed\r\n");
		/*!< CMD Response TimeOut (wait for CMDSENT flag) */
		return (errorstatus);
	}

	logf ("SD_PowerON OK\r\n");

	errorstatus = SD_InitializeCards ();

	if (errorstatus != SD_OK) {
		logf ("SD_InitializeCards failed\r\n");
		/*!< CMD Response TimeOut (wait for CMDSENT flag) */
		return (errorstatus);
	}

	logf ("SD_InitializeCards OK\r\n");

	/*!< Configure the SDIO peripheral */
	/*!< SDIO_CK = SDIOCLK / (SDIO_TRANSFER_CLK_DIV + 2) */
	/*!< on STM32F4xx devices, SDIOCLK is fixed to 48MHz */
	SDIO_InitStructure.SDIO_ClockDiv = SDIO_TRANSFER_CLK_DIV;
	SDIO_InitStructure.SDIO_ClockEdge = SDIO_ClockEdge_Rising;
	SDIO_InitStructure.SDIO_ClockBypass = SDIO_ClockBypass_Disable;
	SDIO_InitStructure.SDIO_ClockPowerSave = SDIO_ClockPowerSave_Disable;
	SDIO_InitStructure.SDIO_BusWide = SDIO_BusWide_1b;
	SDIO_InitStructure.SDIO_HardwareFlowControl = SDIO_HardwareFlowControl_Disable;
	SDIO_Init (&SDIO_InitStructure);

	/*----------------- Read CSD/CID MSD registers ------------------*/
	errorstatus = SD_GetCardInfo (&SDCardInfo);

	if (errorstatus == SD_OK) {
		/*----------------- Select Card --------------------------------*/
		logf ("SD_GetCardInfo OK\r\n");
		errorstatus = SD_SelectDeselect ((uint32_t) (SDCardInfo.RCA << 16));
	}
	else {
		logf ("SD_SelectDeselect failed\r\n");
	}

	if (errorstatus == SD_OK) {
		logf ("SD_SelectDeselect OK\r\n");
#if FATFS_SDIO_4BIT == 1
		//4 bit mode
		errorstatus = SD_EnableWideBusOperation (SDIO_BusWide_4b);
#else
		//1 bit mode
		errorstatus = SD_EnableWideBusOperation (SDIO_BusWide_1b);
#endif
	}
	else {
		logf ("SD_EnableWideBusOperation failed\r\n");
	}

	if (errorstatus == SD_OK) {
		logf ("SD_EnableWideBusOperation OK\r\n");
	}

	return (errorstatus);
}

/**
 * @brief  Gets the cuurent sd card data transfer status.
 * @param  None
 * @retval SDTransferState: Data Transfer state.
 *   This value can be:
 *        - SD_TRANSFER_OK: No data transfer is acting
 *        - SD_TRANSFER_BUSY: Data transfer is acting
 */
SDTransferState SD_GetStatus (void)
{
        SDCardState cardstate = SD_CARD_TRANSFER;

        cardstate = SD_GetState ();

        if (cardstate == SD_CARD_TRANSFER) {
                return (SD_TRANSFER_OK);
        }
        else if (cardstate == SD_CARD_ERROR) {
                return (SD_TRANSFER_ERROR);
        }
        else {
                return (SD_TRANSFER_BUSY);
        }
}

/**
 * @brief  Returns the current card's state.
 * @param  None
 * @retval SDCardState: SD Card Error or SD Card Current State.
 */
SDCardState SD_GetState (void)
{
        uint32_t resp1 = 0;

        if (SD_Detect () == SD_PRESENT ) {
                if (SD_SendStatus (&resp1) != SD_OK) {
					return SD_CARD_ERROR;
                } else {
					return (SDCardState) ((resp1 >> 9) & 0x0F);
                }
        }
        else {
                return SD_CARD_ERROR;
        }
}

/**
 * @brief  Detect if SD card is correctly plugged in the memory slot.
 * @param  None
 * @retval Return if SD is detected or not
 */
uint8_t SD_Detect (void)
{
        __IO uint8_t status = SD_PRESENT;

		#if FATFS_USE_DETECT_PIN > 0
			if (GPIO_ReadInputDataBit(FATFS_USE_DETECT_PIN_PORT, FATFS_USE_DETECT_PIN_PIN) != Bit_RESET) {
				status = SD_NOT_PRESENT;
			}
		#endif

        return status;
}

/**
 * @brief  Enquires cards about their operating voltage and configures
 *   clock controls.
 * @param  None
 * @retval SD_Error: SD Card Error code.
 */
SD_Error SD_PowerON (void)
{
        __IO SD_Error errorstatus = SD_OK;
        uint32_t response = 0, count = 0, validvoltage = 0;
        uint32_t SDType = SD_STD_CAPACITY;

        /*!< Power ON Sequence -----------------------------------------------------*/
        /*!< Configure the SDIO peripheral */
        /*!< SDIO_CK = SDIOCLK / (SDIO_INIT_CLK_DIV + 2) */
        /*!< on STM32F4xx devices, SDIOCLK is fixed to 48MHz */
        /*!< SDIO_CK for initialization should not exceed 400 KHz */
        SDIO_InitStructure.SDIO_ClockDiv = SDIO_INIT_CLK_DIV;
        SDIO_InitStructure.SDIO_ClockEdge = SDIO_ClockEdge_Rising;
        SDIO_InitStructure.SDIO_ClockBypass = SDIO_ClockBypass_Disable;
        SDIO_InitStructure.SDIO_ClockPowerSave = SDIO_ClockPowerSave_Disable;
        SDIO_InitStructure.SDIO_BusWide = SDIO_BusWide_1b;
        SDIO_InitStructure.SDIO_HardwareFlowControl = SDIO_HardwareFlowControl_Disable;
        SDIO_Init (&SDIO_InitStructure);

        /*!< Set Power State to ON */
        SDIO_SetPowerState (SDIO_PowerState_ON);

        /*!< Enable SDIO Clock */
        SDIO_ClockCmd (ENABLE);

