MaJerle/stm32f429/00-STM32F429_LIBRARIES/fatfs/drivers/fatfs_sd_sdio.c
        /*!< CMD0: GO_IDLE_STATE ---------------------------------------------------*/
        /*!< No CMD response required */
        SDIO_CmdInitStructure.SDIO_Argument = 0x0;
        SDIO_CmdInitStructure.SDIO_CmdIndex = SD_CMD_GO_IDLE_STATE;
        SDIO_CmdInitStructure.SDIO_Response = SDIO_Response_No;
        SDIO_CmdInitStructure.SDIO_Wait = SDIO_Wait_No;
        SDIO_CmdInitStructure.SDIO_CPSM = SDIO_CPSM_Enable;
        SDIO_SendCommand (&SDIO_CmdInitStructure);

        errorstatus = CmdError ();

        if (errorstatus != SD_OK) {
                /*!< CMD Response TimeOut (wait for CMDSENT flag) */
                return (errorstatus);
        }

        /*!< CMD8: SEND_IF_COND ----------------------------------------------------*/
        /*!< Send CMD8 to verify SD card interface operating condition */
        /*!< Argument: - [31:12]: Reserved (shall be set to '0')
         - [11:8]: Supply Voltage (VHS) 0x1 (Range: 2.7-3.6 V)
         - [7:0]: Check Pattern (recommended 0xAA) */
        /*!< CMD Response: R7 */
        SDIO_CmdInitStructure.SDIO_Argument = SD_CHECK_PATTERN;
        SDIO_CmdInitStructure.SDIO_CmdIndex = SDIO_SEND_IF_COND;
        SDIO_CmdInitStructure.SDIO_Response = SDIO_Response_Short;
        SDIO_CmdInitStructure.SDIO_Wait = SDIO_Wait_No;
        SDIO_CmdInitStructure.SDIO_CPSM = SDIO_CPSM_Enable;
        SDIO_SendCommand (&SDIO_CmdInitStructure);

        errorstatus = CmdResp7Error ();

        if (errorstatus == SD_OK) {
                CardType = SDIO_STD_CAPACITY_SD_CARD_V2_0; /*!< SD Card 2.0 */
                SDType = SD_HIGH_CAPACITY;
        }
        else {
                /*!< CMD55 */
                SDIO_CmdInitStructure.SDIO_Argument = 0x00;
                SDIO_CmdInitStructure.SDIO_CmdIndex = SD_CMD_APP_CMD;
                SDIO_CmdInitStructure.SDIO_Response = SDIO_Response_Short;
                SDIO_CmdInitStructure.SDIO_Wait = SDIO_Wait_No;
                SDIO_CmdInitStructure.SDIO_CPSM = SDIO_CPSM_Enable;
                SDIO_SendCommand (&SDIO_CmdInitStructure);
                errorstatus = CmdResp1Error (SD_CMD_APP_CMD );
        }
        /*!< CMD55 */
        SDIO_CmdInitStructure.SDIO_Argument = 0x00;
        SDIO_CmdInitStructure.SDIO_CmdIndex = SD_CMD_APP_CMD;
        SDIO_CmdInitStructure.SDIO_Response = SDIO_Response_Short;
        SDIO_CmdInitStructure.SDIO_Wait = SDIO_Wait_No;
        SDIO_CmdInitStructure.SDIO_CPSM = SDIO_CPSM_Enable;
        SDIO_SendCommand (&SDIO_CmdInitStructure);
        errorstatus = CmdResp1Error (SD_CMD_APP_CMD );

        /*!< If errorstatus is Command TimeOut, it is a MMC card */
        /*!< If errorstatus is SD_OK it is a SD card: SD card 2.0 (voltage range mismatch)
         or SD card 1.x */
        if (errorstatus == SD_OK) {
                /*!< SD CARD */
                /*!< Send ACMD41 SD_APP_OP_COND with Argument 0x80100000 */
                while ((!validvoltage) && (count < SD_MAX_VOLT_TRIAL )) {

                        /*!< SEND CMD55 APP_CMD with RCA as 0 */
                        SDIO_CmdInitStructure.SDIO_Argument = 0x00;
                        SDIO_CmdInitStructure.SDIO_CmdIndex = SD_CMD_APP_CMD;
                        SDIO_CmdInitStructure.SDIO_Response = SDIO_Response_Short;
                        SDIO_CmdInitStructure.SDIO_Wait = SDIO_Wait_No;
                        SDIO_CmdInitStructure.SDIO_CPSM = SDIO_CPSM_Enable;
                        SDIO_SendCommand (&SDIO_CmdInitStructure);

                        errorstatus = CmdResp1Error (SD_CMD_APP_CMD );

                        if (errorstatus != SD_OK) {
                                return (errorstatus);
                        }
                        SDIO_CmdInitStructure.SDIO_Argument = SD_VOLTAGE_WINDOW_SD | SDType;
                        SDIO_CmdInitStructure.SDIO_CmdIndex = SD_CMD_SD_APP_OP_COND;
                        SDIO_CmdInitStructure.SDIO_Response = SDIO_Response_Short;
                        SDIO_CmdInitStructure.SDIO_Wait = SDIO_Wait_No;
                        SDIO_CmdInitStructure.SDIO_CPSM = SDIO_CPSM_Enable;
                        SDIO_SendCommand (&SDIO_CmdInitStructure);

                        errorstatus = CmdResp3Error ();
                        if (errorstatus != SD_OK) {
                                return (errorstatus);
                        }

                        response = SDIO_GetResponse (SDIO_RESP1);
                        validvoltage = (((response >> 31) == 1) ? 1 : 0);
                        count++;
                }
                if (count >= SD_MAX_VOLT_TRIAL ) {
                        errorstatus = SD_INVALID_VOLTRANGE;
                        return (errorstatus);
                }

                if (response &= SD_HIGH_CAPACITY ) {
                        CardType = SDIO_HIGH_CAPACITY_SD_CARD;
                }

        }/*!< else MMC Card */

        return (errorstatus);
}

/**
 * @brief  Turns the SDIO output signals off.
 * @param  None
 * @retval SD_Error: SD Card Error code.
 */
SD_Error SD_PowerOFF (void)
{
        SD_Error errorstatus = SD_OK;

        /*!< Set Power State to OFF */
        SDIO_SetPowerState (SDIO_PowerState_OFF);

        return (errorstatus);
}

/**
 * @brief  Intialises all cards or single card as the case may be Card(s) come
 *         into standby state.
 * @param  None
 * @retval SD_Error: SD Card Error code.
 */
SD_Error SD_InitializeCards (void)
{
        SD_Error errorstatus = SD_OK;
        uint16_t rca = 0x01;

        if (SDIO_GetPowerState () == SDIO_PowerState_OFF) {
                errorstatus = SD_REQUEST_NOT_APPLICABLE;
                return (errorstatus);
        }

        if (SDIO_SECURE_DIGITAL_IO_CARD != CardType) {
                /*!< Send CMD2 ALL_SEND_CID */
                SDIO_CmdInitStructure.SDIO_Argument = 0x0;
                SDIO_CmdInitStructure.SDIO_CmdIndex = SD_CMD_ALL_SEND_CID;
                SDIO_CmdInitStructure.SDIO_Response = SDIO_Response_Long;
                SDIO_CmdInitStructure.SDIO_Wait = SDIO_Wait_No;
                SDIO_CmdInitStructure.SDIO_CPSM = SDIO_CPSM_Enable;
                SDIO_SendCommand (&SDIO_CmdInitStructure);

