MaJerle/stm32f429/00-STM32F429_LIBRARIES/fatfs/drivers/fatfs_sd_sdio.c
                errorstatus = CmdResp2Error ();

                if (SD_OK != errorstatus) {
                        return (errorstatus);
                }

                CID_Tab[0] = SDIO_GetResponse (SDIO_RESP1);
                CID_Tab[1] = SDIO_GetResponse (SDIO_RESP2);
                CID_Tab[2] = SDIO_GetResponse (SDIO_RESP3);
                CID_Tab[3] = SDIO_GetResponse (SDIO_RESP4);
        }
        if ((SDIO_STD_CAPACITY_SD_CARD_V1_1 == CardType) || (SDIO_STD_CAPACITY_SD_CARD_V2_0 == CardType) || (SDIO_SECURE_DIGITAL_IO_COMBO_CARD == CardType)
                        || (SDIO_HIGH_CAPACITY_SD_CARD == CardType)) {
                /*!< Send CMD3 SET_REL_ADDR with argument 0 */
                /*!< SD Card publishes its RCA. */
                SDIO_CmdInitStructure.SDIO_Argument = 0x00;
                SDIO_CmdInitStructure.SDIO_CmdIndex = SD_CMD_SET_REL_ADDR;
                SDIO_CmdInitStructure.SDIO_Response = SDIO_Response_Short;
                SDIO_CmdInitStructure.SDIO_Wait = SDIO_Wait_No;
                SDIO_CmdInitStructure.SDIO_CPSM = SDIO_CPSM_Enable;
                SDIO_SendCommand (&SDIO_CmdInitStructure);

                errorstatus = CmdResp6Error (SD_CMD_SET_REL_ADDR, &rca);

                if (SD_OK != errorstatus) {
                        return (errorstatus);
                }
        }

        if (SDIO_SECURE_DIGITAL_IO_CARD != CardType) {
                RCA = rca;

                /*!< Send CMD9 SEND_CSD with argument as card's RCA */
                SDIO_CmdInitStructure.SDIO_Argument = (uint32_t) (rca << 16);
                SDIO_CmdInitStructure.SDIO_CmdIndex = SD_CMD_SEND_CSD;
                SDIO_CmdInitStructure.SDIO_Response = SDIO_Response_Long;
                SDIO_CmdInitStructure.SDIO_Wait = SDIO_Wait_No;
                SDIO_CmdInitStructure.SDIO_CPSM = SDIO_CPSM_Enable;
                SDIO_SendCommand (&SDIO_CmdInitStructure);

                errorstatus = CmdResp2Error ();

                if (SD_OK != errorstatus) {
                        return (errorstatus);
                }

                CSD_Tab[0] = SDIO_GetResponse (SDIO_RESP1);
                CSD_Tab[1] = SDIO_GetResponse (SDIO_RESP2);
                CSD_Tab[2] = SDIO_GetResponse (SDIO_RESP3);
                CSD_Tab[3] = SDIO_GetResponse (SDIO_RESP4);
        }

        errorstatus = SD_OK; /*!< All cards get intialized */

        return (errorstatus);
}

/**
 * @brief  Returns information about specific card.
 * @param  cardinfo: pointer to a SD_CardInfo structure that contains all SD card
 *         information.
 * @retval SD_Error: SD Card Error code.
 */
SD_Error SD_GetCardInfo (SD_CardInfo *cardinfo)
{
        SD_Error errorstatus = SD_OK;
        uint8_t tmp = 0;

        cardinfo->CardType = (uint8_t) CardType;
        cardinfo->RCA = (uint16_t) RCA;

        /*!< Byte 0 */
        tmp = (uint8_t) ((CSD_Tab[0] & 0xFF000000) >> 24);
        cardinfo->SD_csd.CSDStruct = (tmp & 0xC0) >> 6;
        cardinfo->SD_csd.SysSpecVersion = (tmp & 0x3C) >> 2;
        cardinfo->SD_csd.Reserved1 = tmp & 0x03;

        /*!< Byte 1 */
        tmp = (uint8_t) ((CSD_Tab[0] & 0x00FF0000) >> 16);
        cardinfo->SD_csd.TAAC = tmp;

        /*!< Byte 2 */
        tmp = (uint8_t) ((CSD_Tab[0] & 0x0000FF00) >> 8);
        cardinfo->SD_csd.NSAC = tmp;

        /*!< Byte 3 */
        tmp = (uint8_t) (CSD_Tab[0] & 0x000000FF);
        cardinfo->SD_csd.MaxBusClkFrec = tmp;

        /*!< Byte 4 */
        tmp = (uint8_t) ((CSD_Tab[1] & 0xFF000000) >> 24);
        cardinfo->SD_csd.CardComdClasses = tmp << 4;

        /*!< Byte 5 */
        tmp = (uint8_t) ((CSD_Tab[1] & 0x00FF0000) >> 16);
        cardinfo->SD_csd.CardComdClasses |= (tmp & 0xF0) >> 4;
        cardinfo->SD_csd.RdBlockLen = tmp & 0x0F;

        /*!< Byte 6 */
        tmp = (uint8_t) ((CSD_Tab[1] & 0x0000FF00) >> 8);
        cardinfo->SD_csd.PartBlockRead = (tmp & 0x80) >> 7;
        cardinfo->SD_csd.WrBlockMisalign = (tmp & 0x40) >> 6;
        cardinfo->SD_csd.RdBlockMisalign = (tmp & 0x20) >> 5;
        cardinfo->SD_csd.DSRImpl = (tmp & 0x10) >> 4;
        cardinfo->SD_csd.Reserved2 = 0; /*!< Reserved */

        if ((CardType == SDIO_STD_CAPACITY_SD_CARD_V1_1 )|| (CardType == SDIO_STD_CAPACITY_SD_CARD_V2_0)){
        cardinfo->SD_csd.DeviceSize = (tmp & 0x03) << 10;

        /*!< Byte 7 */
        tmp = (uint8_t)(CSD_Tab[1] & 0x000000FF);
        cardinfo->SD_csd.DeviceSize |= (tmp) << 2;

        /*!< Byte 8 */
        tmp = (uint8_t)((CSD_Tab[2] & 0xFF000000) >> 24);
        cardinfo->SD_csd.DeviceSize |= (tmp & 0xC0) >> 6;

        cardinfo->SD_csd.MaxRdCurrentVDDMin = (tmp & 0x38) >> 3;
        cardinfo->SD_csd.MaxRdCurrentVDDMax = (tmp & 0x07);

        /*!< Byte 9 */
        tmp = (uint8_t)((CSD_Tab[2] & 0x00FF0000) >> 16);
        cardinfo->SD_csd.MaxWrCurrentVDDMin = (tmp & 0xE0) >> 5;
        cardinfo->SD_csd.MaxWrCurrentVDDMax = (tmp & 0x1C) >> 2;
        cardinfo->SD_csd.DeviceSizeMul = (tmp & 0x03) << 1;
        /*!< Byte 10 */
        tmp = (uint8_t)((CSD_Tab[2] & 0x0000FF00) >> 8);
        cardinfo->SD_csd.DeviceSizeMul |= (tmp & 0x80) >> 7;

        cardinfo->CardCapacity = (cardinfo->SD_csd.DeviceSize + 1);
        cardinfo->CardCapacity *= (1 << (cardinfo->SD_csd.DeviceSizeMul + 2));
        cardinfo->CardBlockSize = 1 << (cardinfo->SD_csd.RdBlockLen);
        cardinfo->CardCapacity *= cardinfo->CardBlockSize;
}
else if (CardType == SDIO_HIGH_CAPACITY_SD_CARD)
{
        /*!< Byte 7 */
        tmp = (uint8_t)(CSD_Tab[1] & 0x000000FF);
        cardinfo->SD_csd.DeviceSize = (tmp & 0x3F) << 16;

        /*!< Byte 8 */
        tmp = (uint8_t)((CSD_Tab[2] & 0xFF000000) >> 24);

        cardinfo->SD_csd.DeviceSize |= (tmp << 8);

        /*!< Byte 9 */
        tmp = (uint8_t)((CSD_Tab[2] & 0x00FF0000) >> 16);

        cardinfo->SD_csd.DeviceSize |= (tmp);

        /*!< Byte 10 */
        tmp = (uint8_t)((CSD_Tab[2] & 0x0000FF00) >> 8);

        cardinfo->CardCapacity = ((uint64_t)cardinfo->SD_csd.DeviceSize + 1) * 512 * 1024;
        cardinfo->CardBlockSize = 512;
}

