MaJerle/stm32f429/00-STM32F429_LIBRARIES/fatfs/drivers/fatfs_sd_sdio.c
        /*!< Byte 13 */
        tmp = (uint8_t) ((SDSTATUS_Tab[13] & 0x3));
        cardstatus->ERASE_OFFSET = tmp;

        return (errorstatus);
}

/**
 * @brief  Enables wide bus opeartion for the requeseted card if supported by
 *         card.
 * @param  WideMode: Specifies the SD card wide bus mode.
 *   This parameter can be one of the following values:
 *     @arg SDIO_BusWide_8b: 8-bit data transfer (Only for MMC)
 *     @arg SDIO_BusWide_4b: 4-bit data transfer
 *     @arg SDIO_BusWide_1b: 1-bit data transfer
 * @retval SD_Error: SD Card Error code.
 */
SD_Error SD_EnableWideBusOperation (uint32_t WideMode)
{
        SD_Error errorstatus = SD_OK;

        /*!< MMC Card doesn't support this feature */
        if (SDIO_MULTIMEDIA_CARD == CardType) {
                errorstatus = SD_UNSUPPORTED_FEATURE;
                return (errorstatus);
        }
        else if ((SDIO_STD_CAPACITY_SD_CARD_V1_1 == CardType) || (SDIO_STD_CAPACITY_SD_CARD_V2_0 == CardType) || (SDIO_HIGH_CAPACITY_SD_CARD == CardType)) {
                if (SDIO_BusWide_8b == WideMode) {
                        errorstatus = SD_UNSUPPORTED_FEATURE;
                        return (errorstatus);
                }
                else if (SDIO_BusWide_4b == WideMode) {
                        errorstatus = SDEnWideBus (ENABLE);

                        if (SD_OK == errorstatus) {
                                /*!< Configure the SDIO peripheral */
                                SDIO_InitStructure.SDIO_ClockDiv = SDIO_TRANSFER_CLK_DIV;
                                SDIO_InitStructure.SDIO_ClockEdge = SDIO_ClockEdge_Rising;
                                SDIO_InitStructure.SDIO_ClockBypass = SDIO_ClockBypass_Disable;
                                SDIO_InitStructure.SDIO_ClockPowerSave = SDIO_ClockPowerSave_Disable;
                                SDIO_InitStructure.SDIO_BusWide = SDIO_BusWide_4b;
                                SDIO_InitStructure.SDIO_HardwareFlowControl = SDIO_HardwareFlowControl_Disable;
                                SDIO_Init (&SDIO_InitStructure);
                        }
                }
                else {
                        errorstatus = SDEnWideBus (DISABLE);

                        if (SD_OK == errorstatus) {
                                /*!< Configure the SDIO peripheral */
                                SDIO_InitStructure.SDIO_ClockDiv = SDIO_TRANSFER_CLK_DIV;
                                SDIO_InitStructure.SDIO_ClockEdge = SDIO_ClockEdge_Rising;
                                SDIO_InitStructure.SDIO_ClockBypass = SDIO_ClockBypass_Disable;
                                SDIO_InitStructure.SDIO_ClockPowerSave = SDIO_ClockPowerSave_Disable;
                                SDIO_InitStructure.SDIO_BusWide = SDIO_BusWide_1b;
                                SDIO_InitStructure.SDIO_HardwareFlowControl = SDIO_HardwareFlowControl_Disable;
                                SDIO_Init (&SDIO_InitStructure);
                        }
                }
        }

        return (errorstatus);
}

/**
 * @brief  Selects od Deselects the corresponding card.
 * @param  addr: Address of the Card to be selected.
 * @retval SD_Error: SD Card Error code.
 */
SD_Error SD_SelectDeselect (uint64_t addr)
{
        SD_Error errorstatus = SD_OK;

        /*!< Send CMD7 SDIO_SEL_DESEL_CARD */
        SDIO_CmdInitStructure.SDIO_Argument = (uint32_t) addr;
        SDIO_CmdInitStructure.SDIO_CmdIndex = SD_CMD_SEL_DESEL_CARD;
        SDIO_CmdInitStructure.SDIO_Response = SDIO_Response_Short;
        SDIO_CmdInitStructure.SDIO_Wait = SDIO_Wait_No;
        SDIO_CmdInitStructure.SDIO_CPSM = SDIO_CPSM_Enable;
        SDIO_SendCommand (&SDIO_CmdInitStructure);

        errorstatus = CmdResp1Error (SD_CMD_SEL_DESEL_CARD );

        return (errorstatus);
}

/**
 * @brief  Allows to read one block from a specified address in a card. The Data
 *         transfer can be managed by DMA mode or Polling mode.
 * @note   This operation should be followed by two functions to check if the
 *         DMA Controller and SD Card status.
 *          - SD_ReadWaitOperation(): this function insure that the DMA
 *            controller has finished all data transfer.
 *          - SD_GetStatus(): to check that the SD Card has finished the
 *            data transfer and it is ready for data.
 * @param  readbuff: pointer to the buffer that will contain the received data
 * @param  ReadAddr: Address from where data are to be read.
 * @param  BlockSize: the SD card Data block size. The Block size should be 512.
 * @retval SD_Error: SD Card Error code.
 */
SD_Error SD_ReadBlock (uint8_t *readbuff, uint64_t ReadAddr, uint16_t BlockSize)
{
        SD_Error errorstatus = SD_OK;
#if defined (SD_POLLING_MODE) 
        uint32_t count = 0, *tempbuff = (uint32_t *)readbuff;
#endif

        TransferError = SD_OK;
        TransferEnd = 0;
        StopCondition = 0;

        SDIO ->DCTRL = 0x0;

#if defined (SD_DMA_MODE)
        SDIO_ITConfig (SDIO_IT_DCRCFAIL | SDIO_IT_DTIMEOUT | SDIO_IT_DATAEND | SDIO_IT_RXOVERR | SDIO_IT_STBITERR, ENABLE);
        SDIO_DMACmd (ENABLE);
        SD_LowLevel_DMA_RxConfig ((uint32_t *) readbuff, BlockSize);
#endif

        if (CardType == SDIO_HIGH_CAPACITY_SD_CARD ) {
                BlockSize = 512;
                ReadAddr /= 512;
        }

        /* Set Block Size for Card */
        SDIO_CmdInitStructure.SDIO_Argument = (uint32_t) BlockSize;
        SDIO_CmdInitStructure.SDIO_CmdIndex = SD_CMD_SET_BLOCKLEN;
        SDIO_CmdInitStructure.SDIO_Response = SDIO_Response_Short;
        SDIO_CmdInitStructure.SDIO_Wait = SDIO_Wait_No;
        SDIO_CmdInitStructure.SDIO_CPSM = SDIO_CPSM_Enable;
        SDIO_SendCommand (&SDIO_CmdInitStructure);

        errorstatus = CmdResp1Error (SD_CMD_SET_BLOCKLEN );

        if (SD_OK != errorstatus) {
                return (errorstatus);
        }

        SDIO_DataInitStructure.SDIO_DataTimeOut = SD_DATATIMEOUT;
        SDIO_DataInitStructure.SDIO_DataLength = BlockSize;
        SDIO_DataInitStructure.SDIO_DataBlockSize = (uint32_t) 9 << 4;
        SDIO_DataInitStructure.SDIO_TransferDir = SDIO_TransferDir_ToSDIO;
        SDIO_DataInitStructure.SDIO_TransferMode = SDIO_TransferMode_Block;
        SDIO_DataInitStructure.SDIO_DPSM = SDIO_DPSM_Enable;
        SDIO_DataConfig (&SDIO_DataInitStructure);

