MaJerle/stm32f429/00-STM32F429_LIBRARIES/fatfs/drivers/fatfs_sd_sdio.c
        /*!< Send CMD17 READ_SINGLE_BLOCK */
        SDIO_CmdInitStructure.SDIO_Argument = (uint32_t) ReadAddr;
        SDIO_CmdInitStructure.SDIO_CmdIndex = SD_CMD_READ_SINGLE_BLOCK;
        SDIO_CmdInitStructure.SDIO_Response = SDIO_Response_Short;
        SDIO_CmdInitStructure.SDIO_Wait = SDIO_Wait_No;
        SDIO_CmdInitStructure.SDIO_CPSM = SDIO_CPSM_Enable;
        SDIO_SendCommand (&SDIO_CmdInitStructure);

        errorstatus = CmdResp1Error (SD_CMD_READ_SINGLE_BLOCK );

        if (errorstatus != SD_OK) {
                return (errorstatus);
        }

#if defined (SD_POLLING_MODE)  
        /*!< In case of single block transfer, no need of stop transfer at all.*/
        /*!< Polling mode */
        while (!(SDIO->STA &(SDIO_FLAG_RXOVERR | SDIO_FLAG_DCRCFAIL | SDIO_FLAG_DTIMEOUT | SDIO_FLAG_DBCKEND | SDIO_FLAG_STBITERR)))
        {
                if (SDIO_GetFlagStatus(SDIO_FLAG_RXFIFOHF) != RESET)
                {
                        for (count = 0; count < 8; count++)
                        {
                                *(tempbuff + count) = SDIO_ReadData();
                        }
                        tempbuff += 8;
                }
        }

        if (SDIO_GetFlagStatus(SDIO_FLAG_DTIMEOUT) != RESET)
        {
                SDIO_ClearFlag(SDIO_FLAG_DTIMEOUT);
                errorstatus = SD_DATA_TIMEOUT;
                return(errorstatus);
        }
        else if (SDIO_GetFlagStatus(SDIO_FLAG_DCRCFAIL) != RESET)
        {
                SDIO_ClearFlag(SDIO_FLAG_DCRCFAIL);
                errorstatus = SD_DATA_CRC_FAIL;
                return(errorstatus);
        }
        else if (SDIO_GetFlagStatus(SDIO_FLAG_RXOVERR) != RESET)
        {
                SDIO_ClearFlag(SDIO_FLAG_RXOVERR);
                errorstatus = SD_RX_OVERRUN;
                return(errorstatus);
        }
        else if (SDIO_GetFlagStatus(SDIO_FLAG_STBITERR) != RESET)
        {
                SDIO_ClearFlag(SDIO_FLAG_STBITERR);
                errorstatus = SD_START_BIT_ERR;
                return(errorstatus);
        }
        count = SD_DATATIMEOUT;
        while ((SDIO_GetFlagStatus(SDIO_FLAG_RXDAVL) != RESET) && (count > 0))
        {
                *tempbuff = SDIO_ReadData();
                tempbuff++;
                count--;
        }

        /*!< Clear all the static flags */
        SDIO_ClearFlag(SDIO_STATIC_FLAGS);

#endif

        return (errorstatus);
}

/**
 * @brief  Allows to read blocks from a specified address  in a card.  The Data
 *         transfer can be managed by DMA mode or Polling mode.
 * @note   This operation should be followed by two functions to check if the
 *         DMA Controller and SD Card status.
 *          - SD_ReadWaitOperation(): this function insure that the DMA
 *            controller has finished all data transfer.
 *          - SD_GetStatus(): to check that the SD Card has finished the
 *            data transfer and it is ready for data.
 * @param  readbuff: pointer to the buffer that will contain the received data.
 * @param  ReadAddr: Address from where data are to be read.
 * @param  BlockSize: the SD card Data block size. The Block size should be 512.
 * @param  NumberOfBlocks: number of blocks to be read.
 * @retval SD_Error: SD Card Error code.
 */
SD_Error SD_ReadMultiBlocks (uint8_t *readbuff, uint64_t ReadAddr, uint16_t BlockSize, uint32_t NumberOfBlocks)
{
        SD_Error errorstatus = SD_OK;
        TransferError = SD_OK;
        TransferEnd = 0;
        StopCondition = 1;

        SDIO ->DCTRL = 0x0;

#if defined (SD_DMA_MODE)
        SDIO_ITConfig (SDIO_IT_DCRCFAIL | SDIO_IT_DTIMEOUT | SDIO_IT_DATAEND | SDIO_IT_RXOVERR | SDIO_IT_STBITERR, ENABLE);
        SD_LowLevel_DMA_RxConfig ((uint32_t *) readbuff, (NumberOfBlocks * BlockSize));
        SDIO_DMACmd (ENABLE);
#endif

        if (CardType == SDIO_HIGH_CAPACITY_SD_CARD ) {
                BlockSize = 512;
                ReadAddr /= 512;
        }

        /*!< Set Block Size for Card */
        SDIO_CmdInitStructure.SDIO_Argument = (uint32_t) BlockSize;
        SDIO_CmdInitStructure.SDIO_CmdIndex = SD_CMD_SET_BLOCKLEN;
        SDIO_CmdInitStructure.SDIO_Response = SDIO_Response_Short;
        SDIO_CmdInitStructure.SDIO_Wait = SDIO_Wait_No;
        SDIO_CmdInitStructure.SDIO_CPSM = SDIO_CPSM_Enable;
        SDIO_SendCommand (&SDIO_CmdInitStructure);

        errorstatus = CmdResp1Error (SD_CMD_SET_BLOCKLEN );

        if (SD_OK != errorstatus) {
                return (errorstatus);
        }

        SDIO_DataInitStructure.SDIO_DataTimeOut = SD_DATATIMEOUT;
        SDIO_DataInitStructure.SDIO_DataLength = NumberOfBlocks * BlockSize;
        SDIO_DataInitStructure.SDIO_DataBlockSize = (uint32_t) 9 << 4;
        SDIO_DataInitStructure.SDIO_TransferDir = SDIO_TransferDir_ToSDIO;
        SDIO_DataInitStructure.SDIO_TransferMode = SDIO_TransferMode_Block;
        SDIO_DataInitStructure.SDIO_DPSM = SDIO_DPSM_Enable;
        SDIO_DataConfig (&SDIO_DataInitStructure);

        /*!< Send CMD18 READ_MULT_BLOCK with argument data address */
        SDIO_CmdInitStructure.SDIO_Argument = (uint32_t) ReadAddr;
        SDIO_CmdInitStructure.SDIO_CmdIndex = SD_CMD_READ_MULT_BLOCK;
        SDIO_CmdInitStructure.SDIO_Response = SDIO_Response_Short;
        SDIO_CmdInitStructure.SDIO_Wait = SDIO_Wait_No;
        SDIO_CmdInitStructure.SDIO_CPSM = SDIO_CPSM_Enable;
        SDIO_SendCommand (&SDIO_CmdInitStructure);

        errorstatus = CmdResp1Error (SD_CMD_READ_MULT_BLOCK );

        if (errorstatus != SD_OK) {
                return (errorstatus);
        }

        return (errorstatus);
}

/**
 * @brief  This function waits until the SDIO DMA data transfer is finished.
 *         This function should be called after SDIO_ReadMultiBlocks() function
 *         to insure that all data sent by the card are already transferred by
 *         the DMA controller.
 * @param  None.
 * @retval SD_Error: SD Card Error code.
 */
SD_Error SD_WaitReadOperation (void)
{
        SD_Error errorstatus = SD_OK;
        volatile uint32_t timeout;

        timeout = SD_DATATIMEOUT;

        logf ("1\r\n");

