MaJerle/stm32f429/00-STM32F429_LIBRARIES/fatfs/drivers/fatfs_sd_sdio.c
        while ((DMAEndOfTransfer == 0x00) && (TransferEnd == 0) && (TransferError == SD_OK) && (timeout > 0)) {
                timeout--;
        }

        logf ("1.5\r\n");
        //logf ("2 DMAEndOfTransfer = %d, TransferEnd = %d, TransferError = %d, timeout = %d\r\n", DMAEndOfTransfer, TransferEnd, TransferError, timeout);

        DMAEndOfTransfer = 0x00;

        timeout = SD_DATATIMEOUT;

        while (((SDIO ->STA & SDIO_FLAG_RXACT)) && (timeout > 0)) {
                timeout--;
        }

        logf ("3\r\n");

        if (StopCondition == 1) {
                errorstatus = SD_StopTransfer ();
                StopCondition = 0;
        }

        if ((timeout == 0) && (errorstatus == SD_OK)) {
                errorstatus = SD_DATA_TIMEOUT;
        }

        /*!< Clear all the static flags */
        SDIO_ClearFlag (SDIO_STATIC_FLAGS );

        logf ("4\r\n");

        if (TransferError != SD_OK) {
                return (TransferError);
        }
        else {
                return (errorstatus);
        }
}

/**
 * @brief  Allows to write one block starting from a specified address in a card.
 *         The Data transfer can be managed by DMA mode or Polling mode.
 * @note   This operation should be followed by two functions to check if the
 *         DMA Controller and SD Card status.
 *          - SD_ReadWaitOperation(): this function insure that the DMA
 *            controller has finished all data transfer.
 *          - SD_GetStatus(): to check that the SD Card has finished the
 *            data transfer and it is ready for data.
 * @param  writebuff: pointer to the buffer that contain the data to be transferred.
 * @param  WriteAddr: Address from where data are to be read.
 * @param  BlockSize: the SD card Data block size. The Block size should be 512.
 * @retval SD_Error: SD Card Error code.
 */
SD_Error SD_WriteBlock (uint8_t *writebuff, uint64_t WriteAddr, uint16_t BlockSize)
{
        SD_Error errorstatus = SD_OK;

#if defined (SD_POLLING_MODE)
        uint32_t bytestransferred = 0, count = 0, restwords = 0;
        uint32_t *tempbuff = (uint32_t *)writebuff;
#endif

        TransferError = SD_OK;
        TransferEnd = 0;
        StopCondition = 0;

        SDIO ->DCTRL = 0x0;

#if defined (SD_DMA_MODE)
        SDIO_ITConfig (SDIO_IT_DCRCFAIL | SDIO_IT_DTIMEOUT | SDIO_IT_DATAEND | SDIO_IT_RXOVERR | SDIO_IT_STBITERR, ENABLE);
        SD_LowLevel_DMA_TxConfig ((uint32_t *) writebuff, BlockSize);
        SDIO_DMACmd (ENABLE);
#endif

        if (CardType == SDIO_HIGH_CAPACITY_SD_CARD ) {
                BlockSize = 512;
                WriteAddr /= 512;
        }

        /* Set Block Size for Card */
        SDIO_CmdInitStructure.SDIO_Argument = (uint32_t) BlockSize;
        SDIO_CmdInitStructure.SDIO_CmdIndex = SD_CMD_SET_BLOCKLEN;
        SDIO_CmdInitStructure.SDIO_Response = SDIO_Response_Short;
        SDIO_CmdInitStructure.SDIO_Wait = SDIO_Wait_No;
        SDIO_CmdInitStructure.SDIO_CPSM = SDIO_CPSM_Enable;
        SDIO_SendCommand (&SDIO_CmdInitStructure);

        errorstatus = CmdResp1Error (SD_CMD_SET_BLOCKLEN );

        if (SD_OK != errorstatus) {
                return (errorstatus);
        }

        /*!< Send CMD24 WRITE_SINGLE_BLOCK */
        SDIO_CmdInitStructure.SDIO_Argument = (uint32_t) WriteAddr;
        SDIO_CmdInitStructure.SDIO_CmdIndex = SD_CMD_WRITE_SINGLE_BLOCK;
        SDIO_CmdInitStructure.SDIO_Response = SDIO_Response_Short;
        SDIO_CmdInitStructure.SDIO_Wait = SDIO_Wait_No;
        SDIO_CmdInitStructure.SDIO_CPSM = SDIO_CPSM_Enable;
        SDIO_SendCommand (&SDIO_CmdInitStructure);

        errorstatus = CmdResp1Error (SD_CMD_WRITE_SINGLE_BLOCK );

        if (errorstatus != SD_OK) {
                return (errorstatus);
        }

        SDIO_DataInitStructure.SDIO_DataTimeOut = SD_DATATIMEOUT;
        SDIO_DataInitStructure.SDIO_DataLength = BlockSize;
        SDIO_DataInitStructure.SDIO_DataBlockSize = (uint32_t) 9 << 4;
        SDIO_DataInitStructure.SDIO_TransferDir = SDIO_TransferDir_ToCard;
        SDIO_DataInitStructure.SDIO_TransferMode = SDIO_TransferMode_Block;
        SDIO_DataInitStructure.SDIO_DPSM = SDIO_DPSM_Enable;
        SDIO_DataConfig (&SDIO_DataInitStructure);

        /*!< In case of single data block transfer no need of stop command at all */
#if defined (SD_POLLING_MODE) 
        while (!(SDIO->STA & (SDIO_FLAG_DBCKEND | SDIO_FLAG_TXUNDERR | SDIO_FLAG_DCRCFAIL | SDIO_FLAG_DTIMEOUT | SDIO_FLAG_STBITERR)))
        {
                if (SDIO_GetFlagStatus(SDIO_FLAG_TXFIFOHE) != RESET)
                {
                        if ((512 - bytestransferred) < 32)
                        {
                                restwords = ((512 - bytestransferred) % 4 == 0) ? ((512 - bytestransferred) / 4) : (( 512 - bytestransferred) / 4 + 1);
                                for (count = 0; count < restwords; count++, tempbuff++, bytestransferred += 4)
                                {
                                        SDIO_WriteData(*tempbuff);
                                }
                        }
                        else
                        {
                                for (count = 0; count < 8; count++)
                                {
                                        SDIO_WriteData(*(tempbuff + count));
                                }
                                tempbuff += 8;
                                bytestransferred += 32;
                        }
                }
        }
        if (SDIO_GetFlagStatus(SDIO_FLAG_DTIMEOUT) != RESET)
        {
                SDIO_ClearFlag(SDIO_FLAG_DTIMEOUT);
                errorstatus = SD_DATA_TIMEOUT;
                return(errorstatus);
        }
        else if (SDIO_GetFlagStatus(SDIO_FLAG_DCRCFAIL) != RESET)
        {
                SDIO_ClearFlag(SDIO_FLAG_DCRCFAIL);
                errorstatus = SD_DATA_CRC_FAIL;
                return(errorstatus);
        }
        else if (SDIO_GetFlagStatus(SDIO_FLAG_TXUNDERR) != RESET)
        {
                SDIO_ClearFlag(SDIO_FLAG_TXUNDERR);
                errorstatus = SD_TX_UNDERRUN;
                return(errorstatus);
        }
        else if (SDIO_GetFlagStatus(SDIO_FLAG_STBITERR) != RESET)
        {
                SDIO_ClearFlag(SDIO_FLAG_STBITERR);
                errorstatus = SD_START_BIT_ERR;
                return(errorstatus);
        }

#endif

        return (errorstatus);
}

/**
 * @brief  Allows to write blocks starting from a specified address in a card.
 *         The Data transfer can be managed by DMA mode only.
 * @note   This operation should be followed by two functions to check if the
 *         DMA Controller and SD Card status.
 *          - SD_ReadWaitOperation(): this function insure that the DMA
 *            controller has finished all data transfer.
 *          - SD_GetStatus(): to check that the SD Card has finished the
 *            data transfer and it is ready for data.
 * @param  WriteAddr: Address from where data are to be read.
 * @param  writebuff: pointer to the buffer that contain the data to be transferred.
 * @param  BlockSize: the SD card Data block size. The Block size should be 512.
 * @param  NumberOfBlocks: number of blocks to be written.
 * @retval SD_Error: SD Card Error code.
 */
SD_Error SD_WriteMultiBlocks (uint8_t *writebuff, uint64_t WriteAddr, uint16_t BlockSize, uint32_t NumberOfBlocks)
{
        SD_Error errorstatus = SD_OK;

