MaJerle/stm32f429/00-STM32F429_LIBRARIES/fatfs/drivers/fatfs_sd_sdio.c
        /*!< Check if the card coomnd class supports erase command */
        if (((CSD_Tab[1] >> 20) & SD_CCCC_ERASE )== 0){
                errorstatus = SD_REQUEST_NOT_APPLICABLE;
                return (errorstatus);
        }

        maxdelay = 120000 / ((SDIO ->CLKCR & 0xFF) + 2);

        if (SDIO_GetResponse (SDIO_RESP1) & SD_CARD_LOCKED ) {
                errorstatus = SD_LOCK_UNLOCK_FAILED;
                return (errorstatus);
        }

        if (CardType == SDIO_HIGH_CAPACITY_SD_CARD ) {
                startaddr /= 512;
                endaddr /= 512;
        }

        /*!< According to sd-card spec 1.0 ERASE_GROUP_START (CMD32) and erase_group_end(CMD33) */
        if ((SDIO_STD_CAPACITY_SD_CARD_V1_1 == CardType) || (SDIO_STD_CAPACITY_SD_CARD_V2_0 == CardType) || (SDIO_HIGH_CAPACITY_SD_CARD == CardType)) {
                /*!< Send CMD32 SD_ERASE_GRP_START with argument as addr  */
                SDIO_CmdInitStructure.SDIO_Argument = (uint32_t) startaddr;
                SDIO_CmdInitStructure.SDIO_CmdIndex = SD_CMD_SD_ERASE_GRP_START;
                SDIO_CmdInitStructure.SDIO_Response = SDIO_Response_Short;
                SDIO_CmdInitStructure.SDIO_Wait = SDIO_Wait_No;
                SDIO_CmdInitStructure.SDIO_CPSM = SDIO_CPSM_Enable;
                SDIO_SendCommand (&SDIO_CmdInitStructure);

                errorstatus = CmdResp1Error (SD_CMD_SD_ERASE_GRP_START );
                if (errorstatus != SD_OK) {
                        return (errorstatus);
                }

                /*!< Send CMD33 SD_ERASE_GRP_END with argument as addr  */
                SDIO_CmdInitStructure.SDIO_Argument = (uint32_t) endaddr;
                SDIO_CmdInitStructure.SDIO_CmdIndex = SD_CMD_SD_ERASE_GRP_END;
                SDIO_CmdInitStructure.SDIO_Response = SDIO_Response_Short;
                SDIO_CmdInitStructure.SDIO_Wait = SDIO_Wait_No;
                SDIO_CmdInitStructure.SDIO_CPSM = SDIO_CPSM_Enable;
                SDIO_SendCommand (&SDIO_CmdInitStructure);

                errorstatus = CmdResp1Error (SD_CMD_SD_ERASE_GRP_END );
                if (errorstatus != SD_OK) {
                        return (errorstatus);
                }
        }

        /*!< Send CMD38 ERASE */
        SDIO_CmdInitStructure.SDIO_Argument = 0;
        SDIO_CmdInitStructure.SDIO_CmdIndex = SD_CMD_ERASE;
        SDIO_CmdInitStructure.SDIO_Response = SDIO_Response_Short;
        SDIO_CmdInitStructure.SDIO_Wait = SDIO_Wait_No;
        SDIO_CmdInitStructure.SDIO_CPSM = SDIO_CPSM_Enable;
        SDIO_SendCommand (&SDIO_CmdInitStructure);

        errorstatus = CmdResp1Error (SD_CMD_ERASE );

        if (errorstatus != SD_OK) {
                return (errorstatus);
        }

        for (delay = 0; delay < maxdelay; delay++) {
        }

        /*!< Wait till the card is in programming state */
        errorstatus = IsCardProgramming (&cardstate);
        delay = SD_DATATIMEOUT;
        while ((delay > 0) && (errorstatus == SD_OK) && ((SD_CARD_PROGRAMMING == cardstate) || (SD_CARD_RECEIVING == cardstate))) {
                errorstatus = IsCardProgramming (&cardstate);
                delay--;
        }

        return (errorstatus);
}

/**
 * @brief  Returns the current card's status.
 * @param  pcardstatus: pointer to the buffer that will contain the SD card
 *         status (Card Status register).
 * @retval SD_Error: SD Card Error code.
 */
SD_Error SD_SendStatus (uint32_t *pcardstatus)
{
        SD_Error errorstatus = SD_OK;

        if (pcardstatus == 0) {
                errorstatus = SD_INVALID_PARAMETER;
                return (errorstatus);
        }

        SDIO_CmdInitStructure.SDIO_Argument = (uint32_t) RCA << 16;
        SDIO_CmdInitStructure.SDIO_CmdIndex = SD_CMD_SEND_STATUS;
        SDIO_CmdInitStructure.SDIO_Response = SDIO_Response_Short;
        SDIO_CmdInitStructure.SDIO_Wait = SDIO_Wait_No;
        SDIO_CmdInitStructure.SDIO_CPSM = SDIO_CPSM_Enable;
        SDIO_SendCommand (&SDIO_CmdInitStructure);

        errorstatus = CmdResp1Error (SD_CMD_SEND_STATUS );

        if (errorstatus != SD_OK) {
                return (errorstatus);
        }

        *pcardstatus = SDIO_GetResponse (SDIO_RESP1);

        return (errorstatus);
}

/**
 * @brief  Returns the current SD card's status.
 * @param  psdstatus: pointer to the buffer that will contain the SD card status
 *         (SD Status register).
 * @retval SD_Error: SD Card Error code.
 */
SD_Error SD_SendSDStatus (uint32_t *psdstatus)
{
        SD_Error errorstatus = SD_OK;
        uint32_t count = 0;

        if (SDIO_GetResponse (SDIO_RESP1) & SD_CARD_LOCKED ) {
                errorstatus = SD_LOCK_UNLOCK_FAILED;
                return (errorstatus);
        }

        /*!< Set block size for card if it is not equal to current block size for card. */
        SDIO_CmdInitStructure.SDIO_Argument = 64;
        SDIO_CmdInitStructure.SDIO_CmdIndex = SD_CMD_SET_BLOCKLEN;
        SDIO_CmdInitStructure.SDIO_Response = SDIO_Response_Short;
        SDIO_CmdInitStructure.SDIO_Wait = SDIO_Wait_No;
        SDIO_CmdInitStructure.SDIO_CPSM = SDIO_CPSM_Enable;
        SDIO_SendCommand (&SDIO_CmdInitStructure);

        errorstatus = CmdResp1Error (SD_CMD_SET_BLOCKLEN );

        if (errorstatus != SD_OK) {
                return (errorstatus);
        }

        /*!< CMD55 */
        SDIO_CmdInitStructure.SDIO_Argument = (uint32_t) RCA << 16;
        SDIO_CmdInitStructure.SDIO_CmdIndex = SD_CMD_APP_CMD;
        SDIO_CmdInitStructure.SDIO_Response = SDIO_Response_Short;
        SDIO_CmdInitStructure.SDIO_Wait = SDIO_Wait_No;
        SDIO_CmdInitStructure.SDIO_CPSM = SDIO_CPSM_Enable;
        SDIO_SendCommand (&SDIO_CmdInitStructure);
        errorstatus = CmdResp1Error (SD_CMD_APP_CMD );

        if (errorstatus != SD_OK) {
                return (errorstatus);
        }

        SDIO_DataInitStructure.SDIO_DataTimeOut = SD_DATATIMEOUT;
        SDIO_DataInitStructure.SDIO_DataLength = 64;
        SDIO_DataInitStructure.SDIO_DataBlockSize = SDIO_DataBlockSize_64b;
        SDIO_DataInitStructure.SDIO_TransferDir = SDIO_TransferDir_ToSDIO;
        SDIO_DataInitStructure.SDIO_TransferMode = SDIO_TransferMode_Block;
        SDIO_DataInitStructure.SDIO_DPSM = SDIO_DPSM_Enable;
        SDIO_DataConfig (&SDIO_DataInitStructure);

        /*!< Send ACMD13 SD_APP_STAUS  with argument as card's RCA.*/
        SDIO_CmdInitStructure.SDIO_Argument = 0;
        SDIO_CmdInitStructure.SDIO_CmdIndex = SD_CMD_SD_APP_STAUS;
        SDIO_CmdInitStructure.SDIO_Response = SDIO_Response_Short;
        SDIO_CmdInitStructure.SDIO_Wait = SDIO_Wait_No;
        SDIO_CmdInitStructure.SDIO_CPSM = SDIO_CPSM_Enable;
        SDIO_SendCommand (&SDIO_CmdInitStructure);
        errorstatus = CmdResp1Error (SD_CMD_SD_APP_STAUS );

