MaJerle/stm32f429/00-STM32F429_LIBRARIES/fatfs/drivers/fatfs_sd_sdio.c
        if (errorstatus != SD_OK) {
                return (errorstatus);
        }

        while (!(SDIO ->STA & (SDIO_FLAG_RXOVERR | SDIO_FLAG_DCRCFAIL | SDIO_FLAG_DTIMEOUT | SDIO_FLAG_DBCKEND | SDIO_FLAG_STBITERR))) {
                if (SDIO_GetFlagStatus (SDIO_FLAG_RXFIFOHF) != RESET) {
                        for (count = 0; count < 8; count++) {
                                *(psdstatus + count) = SDIO_ReadData ();
                        }
                        psdstatus += 8;
                }
        }

        if (SDIO_GetFlagStatus (SDIO_FLAG_DTIMEOUT) != RESET) {
                SDIO_ClearFlag (SDIO_FLAG_DTIMEOUT);
                errorstatus = SD_DATA_TIMEOUT;
                return (errorstatus);
        }
        else if (SDIO_GetFlagStatus (SDIO_FLAG_DCRCFAIL) != RESET) {
                SDIO_ClearFlag (SDIO_FLAG_DCRCFAIL);
                errorstatus = SD_DATA_CRC_FAIL;
                return (errorstatus);
        }
        else if (SDIO_GetFlagStatus (SDIO_FLAG_RXOVERR) != RESET) {
                SDIO_ClearFlag (SDIO_FLAG_RXOVERR);
                errorstatus = SD_RX_OVERRUN;
                return (errorstatus);
        }
        else if (SDIO_GetFlagStatus (SDIO_FLAG_STBITERR) != RESET) {
                SDIO_ClearFlag (SDIO_FLAG_STBITERR);
                errorstatus = SD_START_BIT_ERR;
                return (errorstatus);
        }

        count = SD_DATATIMEOUT;
        while ((SDIO_GetFlagStatus (SDIO_FLAG_RXDAVL) != RESET) && (count > 0)) {
                *psdstatus = SDIO_ReadData ();
                psdstatus++;
                count--;
        }
        /*!< Clear all the static status flags*/
        SDIO_ClearFlag (SDIO_STATIC_FLAGS );

        return (errorstatus);
}

/**
 * @brief  Allows to process all the interrupts that are high.
 * @param  None
 * @retval SD_Error: SD Card Error code.
 */
SD_Error SD_ProcessIRQSrc (void)
{
        if (SDIO_GetITStatus (SDIO_IT_DATAEND) != RESET) {
                TransferError = SD_OK;
                SDIO_ClearITPendingBit (SDIO_IT_DATAEND);
                TransferEnd = 1;
                logf ("SDIO IRQ : TransferEnd = 1, OK\r\n");
        }
        else if (SDIO_GetITStatus (SDIO_IT_DCRCFAIL) != RESET) {
                SDIO_ClearITPendingBit (SDIO_IT_DCRCFAIL);
                TransferError = SD_DATA_CRC_FAIL;
                logf ("SDIO IRQ : SD_DATA_CRC_FAIL\r\n");
        }
        else if (SDIO_GetITStatus (SDIO_IT_DTIMEOUT) != RESET) {
                SDIO_ClearITPendingBit (SDIO_IT_DTIMEOUT);
                TransferError = SD_DATA_TIMEOUT;
                logf ("SDIO IRQ : SD_DATA_TIMEOUT\r\n");
        }
        else if (SDIO_GetITStatus (SDIO_IT_RXOVERR) != RESET) {
                SDIO_ClearITPendingBit (SDIO_IT_RXOVERR);
                TransferError = SD_RX_OVERRUN;
                logf ("SDIO IRQ : SD_RX_OVERRUN\r\n");
        }
        else if (SDIO_GetITStatus (SDIO_IT_TXUNDERR) != RESET) {
                SDIO_ClearITPendingBit (SDIO_IT_TXUNDERR);
                TransferError = SD_TX_UNDERRUN;
                logf ("SDIO IRQ : SD_TX_UNDERRUN\r\n");
        }
        else if (SDIO_GetITStatus (SDIO_IT_STBITERR) != RESET) {
                SDIO_ClearITPendingBit (SDIO_IT_STBITERR);
                TransferError = SD_START_BIT_ERR;
                logf ("SDIO IRQ : SD_START_BIT_ERR\r\n");
        }

        SDIO_ITConfig (SDIO_IT_DCRCFAIL | SDIO_IT_DTIMEOUT | SDIO_IT_DATAEND | SDIO_IT_TXFIFOHE | SDIO_IT_RXFIFOHF | SDIO_IT_TXUNDERR | SDIO_IT_RXOVERR | SDIO_IT_STBITERR, DISABLE);
        return (TransferError);
}

/**
 * @brief  This function waits until the SDIO DMA data transfer is finished.
 * @param  None.
 * @retval None.
 */
void SD_ProcessDMAIRQ (void)
{
        if (DMA2 ->LISR & SD_SDIO_DMA_FLAG_TCIF) {
                DMAEndOfTransfer = 0x01;
                DMA_ClearFlag (SD_SDIO_DMA_STREAM, SD_SDIO_DMA_FLAG_TCIF | SD_SDIO_DMA_FLAG_FEIF);
        }
        logf ("DMA...\r\n");
}

/**
 * @brief  Checks for error conditions for CMD0.
 * @param  None
 * @retval SD_Error: SD Card Error code.
 */
static SD_Error CmdError (void)
{
        SD_Error errorstatus = SD_OK;
        uint32_t timeout;

        timeout = SDIO_CMD0TIMEOUT; /*!< 10000 */

        while ((timeout > 0) && (SDIO_GetFlagStatus (SDIO_FLAG_CMDSENT) == RESET)) {
                timeout--;
        }

        if (timeout == 0) {
                errorstatus = SD_CMD_RSP_TIMEOUT;
                return (errorstatus);
        }

        /*!< Clear all the static flags */
        SDIO_ClearFlag (SDIO_STATIC_FLAGS );

        return (errorstatus);
}

/**
 * @brief  Checks for error conditions for R7 response.
 * @param  None
 * @retval SD_Error: SD Card Error code.
 */
static SD_Error CmdResp7Error (void)
{
        SD_Error errorstatus = SD_OK;
        uint32_t status;
        uint32_t timeout = SDIO_CMD0TIMEOUT;

        status = SDIO ->STA;

        while (!(status & (SDIO_FLAG_CCRCFAIL | SDIO_FLAG_CMDREND | SDIO_FLAG_CTIMEOUT)) && (timeout > 0)) {
                timeout--;
                status = SDIO ->STA;
        }

        if ((timeout == 0) || (status & SDIO_FLAG_CTIMEOUT)) {
                /*!< Card is not V2.0 complient or card does not support the set voltage range */
                errorstatus = SD_CMD_RSP_TIMEOUT;
                SDIO_ClearFlag (SDIO_FLAG_CTIMEOUT);
                return (errorstatus);
        }

        if (status & SDIO_FLAG_CMDREND) {
                /*!< Card is SD V2.0 compliant */
                errorstatus = SD_OK;
                SDIO_ClearFlag (SDIO_FLAG_CMDREND);
                return (errorstatus);
        }
        return (errorstatus);
}

/**
 * @brief  Checks for error conditions for R1 response.
 * @param  cmd: The sent command index.
 * @retval SD_Error: SD Card Error code.
 */
static SD_Error CmdResp1Error (uint8_t cmd)
{
        SD_Error errorstatus = SD_OK;
        uint32_t status;
        uint32_t response_r1;

        status = SDIO ->STA;

        while (!(status & (SDIO_FLAG_CCRCFAIL | SDIO_FLAG_CMDREND | SDIO_FLAG_CTIMEOUT))) {
                status = SDIO ->STA;
        }

        if (status & SDIO_FLAG_CTIMEOUT) {
                errorstatus = SD_CMD_RSP_TIMEOUT;
                SDIO_ClearFlag (SDIO_FLAG_CTIMEOUT);
                return (errorstatus);
        }
        else if (status & SDIO_FLAG_CCRCFAIL) {
                errorstatus = SD_CMD_CRC_FAIL;
                SDIO_ClearFlag (SDIO_FLAG_CCRCFAIL);
                return (errorstatus);
        }

