MaJerle/stm32f429/00-STM32F429_LIBRARIES/fatfs/drivers/fatfs_sd_sdio.c
        /*!< Check response received is of desired command */
        if (SDIO_GetCommandResponse () != cmd) {
                errorstatus = SD_ILLEGAL_CMD;
                return (errorstatus);
        }

        /*!< Clear all the static flags */
        SDIO_ClearFlag (SDIO_STATIC_FLAGS );

        /*!< We have received response, retrieve it for analysis  */
        response_r1 = SDIO_GetResponse (SDIO_RESP1);

        if ((response_r1 & SD_OCR_ERRORBITS )== SD_ALLZERO) {
                return (errorstatus);
        }

        if (response_r1 & SD_OCR_ADDR_OUT_OF_RANGE ) {
                return (SD_ADDR_OUT_OF_RANGE);
        }

        if (response_r1 & SD_OCR_ADDR_MISALIGNED ) {
                return (SD_ADDR_MISALIGNED);
        }

        if (response_r1 & SD_OCR_BLOCK_LEN_ERR ) {
                return (SD_BLOCK_LEN_ERR);
        }

        if (response_r1 & SD_OCR_ERASE_SEQ_ERR ) {
                return (SD_ERASE_SEQ_ERR);
        }

        if (response_r1 & SD_OCR_BAD_ERASE_PARAM ) {
                return (SD_BAD_ERASE_PARAM);
        }

        if (response_r1 & SD_OCR_WRITE_PROT_VIOLATION ) {
                return (SD_WRITE_PROT_VIOLATION);
        }

        if (response_r1 & SD_OCR_LOCK_UNLOCK_FAILED ) {
                return (SD_LOCK_UNLOCK_FAILED);
        }

        if (response_r1 & SD_OCR_COM_CRC_FAILED ) {
                return (SD_COM_CRC_FAILED);
        }

        if (response_r1 & SD_OCR_ILLEGAL_CMD ) {
                return (SD_ILLEGAL_CMD);
        }

        if (response_r1 & SD_OCR_CARD_ECC_FAILED ) {
                return (SD_CARD_ECC_FAILED);
        }

        if (response_r1 & SD_OCR_CC_ERROR ) {
                return (SD_CC_ERROR);
        }

        if (response_r1 & SD_OCR_GENERAL_UNKNOWN_ERROR ) {
                return (SD_GENERAL_UNKNOWN_ERROR);
        }

        if (response_r1 & SD_OCR_STREAM_READ_UNDERRUN ) {
                return (SD_STREAM_READ_UNDERRUN);
        }

        if (response_r1 & SD_OCR_STREAM_WRITE_OVERRUN ) {
                return (SD_STREAM_WRITE_OVERRUN);
        }

        if (response_r1 & SD_OCR_CID_CSD_OVERWRIETE ) {
                return (SD_CID_CSD_OVERWRITE);
        }

        if (response_r1 & SD_OCR_WP_ERASE_SKIP ) {
                return (SD_WP_ERASE_SKIP);
        }

        if (response_r1 & SD_OCR_CARD_ECC_DISABLED ) {
                return (SD_CARD_ECC_DISABLED);
        }

        if (response_r1 & SD_OCR_ERASE_RESET ) {
                return (SD_ERASE_RESET);
        }

        if (response_r1 & SD_OCR_AKE_SEQ_ERROR ) {
                return (SD_AKE_SEQ_ERROR);
        }
        return (errorstatus);
}

/**
 * @brief  Checks for error conditions for R3 (OCR) response.
 * @param  None
 * @retval SD_Error: SD Card Error code.
 */
static SD_Error CmdResp3Error (void)
{
        SD_Error errorstatus = SD_OK;
        uint32_t status;

        status = SDIO ->STA;

        while (!(status & (SDIO_FLAG_CCRCFAIL | SDIO_FLAG_CMDREND | SDIO_FLAG_CTIMEOUT))) {
                status = SDIO ->STA;
        }

        if (status & SDIO_FLAG_CTIMEOUT) {
                errorstatus = SD_CMD_RSP_TIMEOUT;
                SDIO_ClearFlag (SDIO_FLAG_CTIMEOUT);
                return (errorstatus);
        }
        /*!< Clear all the static flags */
        SDIO_ClearFlag (SDIO_STATIC_FLAGS );
        return (errorstatus);
}

/**
 * @brief  Checks for error conditions for R2 (CID or CSD) response.
 * @param  None
 * @retval SD_Error: SD Card Error code.
 */
static SD_Error CmdResp2Error (void)
{
        SD_Error errorstatus = SD_OK;
        uint32_t status;

        status = SDIO ->STA;

        while (!(status & (SDIO_FLAG_CCRCFAIL | SDIO_FLAG_CTIMEOUT | SDIO_FLAG_CMDREND))) {
                status = SDIO ->STA;
        }

        if (status & SDIO_FLAG_CTIMEOUT) {
                errorstatus = SD_CMD_RSP_TIMEOUT;
                SDIO_ClearFlag (SDIO_FLAG_CTIMEOUT);
                return (errorstatus);
        }
        else if (status & SDIO_FLAG_CCRCFAIL) {
                errorstatus = SD_CMD_CRC_FAIL;
                SDIO_ClearFlag (SDIO_FLAG_CCRCFAIL);
                return (errorstatus);
        }

        /*!< Clear all the static flags */
        SDIO_ClearFlag (SDIO_STATIC_FLAGS );

        return (errorstatus);
}

/**
 * @brief  Checks for error conditions for R6 (RCA) response.
 * @param  cmd: The sent command index.
 * @param  prca: pointer to the variable that will contain the SD card relative
 *         address RCA.
 * @retval SD_Error: SD Card Error code.
 */
static SD_Error CmdResp6Error (uint8_t cmd, uint16_t *prca)
{
        SD_Error errorstatus = SD_OK;
        uint32_t status;
        uint32_t response_r1;

        status = SDIO ->STA;

        while (!(status & (SDIO_FLAG_CCRCFAIL | SDIO_FLAG_CTIMEOUT | SDIO_FLAG_CMDREND))) {
                status = SDIO ->STA;
        }

        if (status & SDIO_FLAG_CTIMEOUT) {
                errorstatus = SD_CMD_RSP_TIMEOUT;
                SDIO_ClearFlag (SDIO_FLAG_CTIMEOUT);
                return (errorstatus);
        }
        else if (status & SDIO_FLAG_CCRCFAIL) {
                errorstatus = SD_CMD_CRC_FAIL;
                SDIO_ClearFlag (SDIO_FLAG_CCRCFAIL);
                return (errorstatus);
        }

        /*!< Check response received is of desired command */
        if (SDIO_GetCommandResponse () != cmd) {
                errorstatus = SD_ILLEGAL_CMD;
                return (errorstatus);
        }

        /*!< Clear all the static flags */
        SDIO_ClearFlag (SDIO_STATIC_FLAGS );

        /*!< We have received response, retrieve it.  */
        response_r1 = SDIO_GetResponse (SDIO_RESP1);

        if (SD_ALLZERO == (response_r1 & (SD_R6_GENERAL_UNKNOWN_ERROR | SD_R6_ILLEGAL_CMD | SD_R6_COM_CRC_FAILED ))) {
                *prca = (uint16_t) (response_r1 >> 16);
                return (errorstatus);
        }

        if (response_r1 & SD_R6_GENERAL_UNKNOWN_ERROR ) {
                return (SD_GENERAL_UNKNOWN_ERROR);
        }

        if (response_r1 & SD_R6_ILLEGAL_CMD ) {
                return (SD_ILLEGAL_CMD);
        }

        if (response_r1 & SD_R6_COM_CRC_FAILED ) {
                return (SD_COM_CRC_FAILED);
        }

        return (errorstatus);
}

/**
 * @brief  Enables or disables the SDIO wide bus mode.
 * @param  NewState: new state of the SDIO wide bus mode.
 *   This parameter can be: ENABLE or DISABLE.
 * @retval SD_Error: SD Card Error code.
 */
static SD_Error SDEnWideBus (FunctionalState NewState)
{
        SD_Error errorstatus = SD_OK;

