MaJerle/stm32f429/00-STM32F429_LIBRARIES/fatfs/drivers/fatfs_sd_sdio.c
        uint32_t scr[2] = { 0, 0 };

        if (SDIO_GetResponse (SDIO_RESP1) & SD_CARD_LOCKED ) {
                errorstatus = SD_LOCK_UNLOCK_FAILED;
                return (errorstatus);
        }

        /*!< Get SCR Register */
        errorstatus = FindSCR (RCA, scr);

        if (errorstatus != SD_OK) {
                return (errorstatus);
        }

        /*!< If wide bus operation to be enabled */
        if (NewState == ENABLE) {
                /*!< If requested card supports wide bus operation */
                if ((scr[1] & SD_WIDE_BUS_SUPPORT )!= SD_ALLZERO) {
                        /*!< Send CMD55 APP_CMD with argument as card's RCA.*/
                        SDIO_CmdInitStructure.SDIO_Argument = (uint32_t) RCA << 16;
                        SDIO_CmdInitStructure.SDIO_CmdIndex = SD_CMD_APP_CMD;
                        SDIO_CmdInitStructure.SDIO_Response = SDIO_Response_Short;
                        SDIO_CmdInitStructure.SDIO_Wait = SDIO_Wait_No;
                        SDIO_CmdInitStructure.SDIO_CPSM = SDIO_CPSM_Enable;
                        SDIO_SendCommand (&SDIO_CmdInitStructure);

                        errorstatus = CmdResp1Error (SD_CMD_APP_CMD );

                        if (errorstatus != SD_OK) {
                                return (errorstatus);
                        }

                        /*!< Send ACMD6 APP_CMD with argument as 2 for wide bus mode */
                        SDIO_CmdInitStructure.SDIO_Argument = 0x2;
                        SDIO_CmdInitStructure.SDIO_CmdIndex = SD_CMD_APP_SD_SET_BUSWIDTH;
                        SDIO_CmdInitStructure.SDIO_Response = SDIO_Response_Short;
                        SDIO_CmdInitStructure.SDIO_Wait = SDIO_Wait_No;
                        SDIO_CmdInitStructure.SDIO_CPSM = SDIO_CPSM_Enable;
                        SDIO_SendCommand (&SDIO_CmdInitStructure);

                        errorstatus = CmdResp1Error (SD_CMD_APP_SD_SET_BUSWIDTH );

                        if (errorstatus != SD_OK) {
                                return (errorstatus);
                        }
                        return (errorstatus);
                }
                else {
                        errorstatus = SD_REQUEST_NOT_APPLICABLE;
                        return (errorstatus);
                }
        } /*!< If wide bus operation to be disabled */
        else {
                /*!< If requested card supports 1 bit mode operation */
                if ((scr[1] & SD_SINGLE_BUS_SUPPORT )!= SD_ALLZERO) {
                        /*!< Send CMD55 APP_CMD with argument as card's RCA.*/
                        SDIO_CmdInitStructure.SDIO_Argument = (uint32_t) RCA << 16;
                        SDIO_CmdInitStructure.SDIO_CmdIndex = SD_CMD_APP_CMD;
                        SDIO_CmdInitStructure.SDIO_Response = SDIO_Response_Short;
                        SDIO_CmdInitStructure.SDIO_Wait = SDIO_Wait_No;
                        SDIO_CmdInitStructure.SDIO_CPSM = SDIO_CPSM_Enable;
                        SDIO_SendCommand (&SDIO_CmdInitStructure);

                        errorstatus = CmdResp1Error (SD_CMD_APP_CMD );

                        if (errorstatus != SD_OK) {
                                return (errorstatus);
                        }

                        /*!< Send ACMD6 APP_CMD with argument as 2 for wide bus mode */
                        SDIO_CmdInitStructure.SDIO_Argument = 0x00;
                        SDIO_CmdInitStructure.SDIO_CmdIndex = SD_CMD_APP_SD_SET_BUSWIDTH;
                        SDIO_CmdInitStructure.SDIO_Response = SDIO_Response_Short;
                        SDIO_CmdInitStructure.SDIO_Wait = SDIO_Wait_No;
                        SDIO_CmdInitStructure.SDIO_CPSM = SDIO_CPSM_Enable;
                        SDIO_SendCommand (&SDIO_CmdInitStructure);

                        errorstatus = CmdResp1Error (SD_CMD_APP_SD_SET_BUSWIDTH );

                        if (errorstatus != SD_OK) {
                                return (errorstatus);
                        }

                        return (errorstatus);
                }
                else {
                        errorstatus = SD_REQUEST_NOT_APPLICABLE;
                        return (errorstatus);
                }
        }
}

/**
 * @brief  Checks if the SD card is in programming state.
 * @param  pstatus: pointer to the variable that will contain the SD card state.
 * @retval SD_Error: SD Card Error code.
 */
static SD_Error IsCardProgramming (uint8_t *pstatus)
{
        SD_Error errorstatus = SD_OK;
        __IO uint32_t respR1 = 0, status = 0;

        SDIO_CmdInitStructure.SDIO_Argument = (uint32_t) RCA << 16;
        SDIO_CmdInitStructure.SDIO_CmdIndex = SD_CMD_SEND_STATUS;
        SDIO_CmdInitStructure.SDIO_Response = SDIO_Response_Short;
        SDIO_CmdInitStructure.SDIO_Wait = SDIO_Wait_No;
        SDIO_CmdInitStructure.SDIO_CPSM = SDIO_CPSM_Enable;
        SDIO_SendCommand (&SDIO_CmdInitStructure);

        status = SDIO ->STA;
        while (!(status & (SDIO_FLAG_CCRCFAIL | SDIO_FLAG_CMDREND | SDIO_FLAG_CTIMEOUT))) {
                status = SDIO ->STA;
        }

        if (status & SDIO_FLAG_CTIMEOUT) {
                errorstatus = SD_CMD_RSP_TIMEOUT;
                SDIO_ClearFlag (SDIO_FLAG_CTIMEOUT);
                return (errorstatus);
        }
        else if (status & SDIO_FLAG_CCRCFAIL) {
                errorstatus = SD_CMD_CRC_FAIL;
                SDIO_ClearFlag (SDIO_FLAG_CCRCFAIL);
                return (errorstatus);
        }

        status = (uint32_t) SDIO_GetCommandResponse ();

        /*!< Check response received is of desired command */
        if (status != SD_CMD_SEND_STATUS ) {
                errorstatus = SD_ILLEGAL_CMD;
                return (errorstatus);
        }

        /*!< Clear all the static flags */
        SDIO_ClearFlag (SDIO_STATIC_FLAGS );

        /*!< We have received response, retrieve it for analysis  */
        respR1 = SDIO_GetResponse (SDIO_RESP1);

        /*!< Find out card status */
        *pstatus = (uint8_t) ((respR1 >> 9) & 0x0000000F);

        if ((respR1 & SD_OCR_ERRORBITS )== SD_ALLZERO) {
                return (errorstatus);
        }

