MaJerle/stm32f429/00-STM32F429_LIBRARIES/fatfs/drivers/fatfs_sd_sdio.c
        if (respR1 & SD_OCR_ADDR_OUT_OF_RANGE ) {
                return (SD_ADDR_OUT_OF_RANGE);
        }

        if (respR1 & SD_OCR_ADDR_MISALIGNED ) {
                return (SD_ADDR_MISALIGNED);
        }

        if (respR1 & SD_OCR_BLOCK_LEN_ERR ) {
                return (SD_BLOCK_LEN_ERR);
        }

        if (respR1 & SD_OCR_ERASE_SEQ_ERR ) {
                return (SD_ERASE_SEQ_ERR);
        }

        if (respR1 & SD_OCR_BAD_ERASE_PARAM ) {
                return (SD_BAD_ERASE_PARAM);
        }

        if (respR1 & SD_OCR_WRITE_PROT_VIOLATION ) {
                return (SD_WRITE_PROT_VIOLATION);
        }

        if (respR1 & SD_OCR_LOCK_UNLOCK_FAILED ) {
                return (SD_LOCK_UNLOCK_FAILED);
        }

        if (respR1 & SD_OCR_COM_CRC_FAILED ) {
                return (SD_COM_CRC_FAILED);
        }

        if (respR1 & SD_OCR_ILLEGAL_CMD ) {
                return (SD_ILLEGAL_CMD);
        }

        if (respR1 & SD_OCR_CARD_ECC_FAILED ) {
                return (SD_CARD_ECC_FAILED);
        }

        if (respR1 & SD_OCR_CC_ERROR ) {
                return (SD_CC_ERROR);
        }

        if (respR1 & SD_OCR_GENERAL_UNKNOWN_ERROR ) {
                return (SD_GENERAL_UNKNOWN_ERROR);
        }

        if (respR1 & SD_OCR_STREAM_READ_UNDERRUN ) {
                return (SD_STREAM_READ_UNDERRUN);
        }

        if (respR1 & SD_OCR_STREAM_WRITE_OVERRUN ) {
                return (SD_STREAM_WRITE_OVERRUN);
        }

        if (respR1 & SD_OCR_CID_CSD_OVERWRIETE ) {
                return (SD_CID_CSD_OVERWRITE);
        }

        if (respR1 & SD_OCR_WP_ERASE_SKIP ) {
                return (SD_WP_ERASE_SKIP);
        }

        if (respR1 & SD_OCR_CARD_ECC_DISABLED ) {
                return (SD_CARD_ECC_DISABLED);
        }

        if (respR1 & SD_OCR_ERASE_RESET ) {
                return (SD_ERASE_RESET);
        }

        if (respR1 & SD_OCR_AKE_SEQ_ERROR ) {
                return (SD_AKE_SEQ_ERROR);
        }

        return (errorstatus);
}

/**
 * @brief  Find the SD card SCR register value.
 * @param  rca: selected card address.
 * @param  pscr: pointer to the buffer that will contain the SCR value.
 * @retval SD_Error: SD Card Error code.
 */
static SD_Error FindSCR (uint16_t rca, uint32_t *pscr)
{
        uint32_t index = 0;
        SD_Error errorstatus = SD_OK;
        uint32_t tempscr[2] = { 0, 0 };

        /*!< Set Block Size To 8 Bytes */
        /*!< Send CMD55 APP_CMD with argument as card's RCA */
        SDIO_CmdInitStructure.SDIO_Argument = (uint32_t) 8;
        SDIO_CmdInitStructure.SDIO_CmdIndex = SD_CMD_SET_BLOCKLEN;
        SDIO_CmdInitStructure.SDIO_Response = SDIO_Response_Short;
        SDIO_CmdInitStructure.SDIO_Wait = SDIO_Wait_No;
        SDIO_CmdInitStructure.SDIO_CPSM = SDIO_CPSM_Enable;
        SDIO_SendCommand (&SDIO_CmdInitStructure);

        errorstatus = CmdResp1Error (SD_CMD_SET_BLOCKLEN );

        if (errorstatus != SD_OK) {
                return (errorstatus);
        }

        /*!< Send CMD55 APP_CMD with argument as card's RCA */
        SDIO_CmdInitStructure.SDIO_Argument = (uint32_t) RCA << 16;
        SDIO_CmdInitStructure.SDIO_CmdIndex = SD_CMD_APP_CMD;
        SDIO_CmdInitStructure.SDIO_Response = SDIO_Response_Short;
        SDIO_CmdInitStructure.SDIO_Wait = SDIO_Wait_No;
        SDIO_CmdInitStructure.SDIO_CPSM = SDIO_CPSM_Enable;
        SDIO_SendCommand (&SDIO_CmdInitStructure);

        errorstatus = CmdResp1Error (SD_CMD_APP_CMD );

        if (errorstatus != SD_OK) {
                return (errorstatus);
        }
        SDIO_DataInitStructure.SDIO_DataTimeOut = SD_DATATIMEOUT;
        SDIO_DataInitStructure.SDIO_DataLength = 8;
        SDIO_DataInitStructure.SDIO_DataBlockSize = SDIO_DataBlockSize_8b;
        SDIO_DataInitStructure.SDIO_TransferDir = SDIO_TransferDir_ToSDIO;
        SDIO_DataInitStructure.SDIO_TransferMode = SDIO_TransferMode_Block;
        SDIO_DataInitStructure.SDIO_DPSM = SDIO_DPSM_Enable;
        SDIO_DataConfig (&SDIO_DataInitStructure);

        /*!< Send ACMD51 SD_APP_SEND_SCR with argument as 0 */
        SDIO_CmdInitStructure.SDIO_Argument = 0x0;
        SDIO_CmdInitStructure.SDIO_CmdIndex = SD_CMD_SD_APP_SEND_SCR;
        SDIO_CmdInitStructure.SDIO_Response = SDIO_Response_Short;
        SDIO_CmdInitStructure.SDIO_Wait = SDIO_Wait_No;
        SDIO_CmdInitStructure.SDIO_CPSM = SDIO_CPSM_Enable;
        SDIO_SendCommand (&SDIO_CmdInitStructure);

        errorstatus = CmdResp1Error (SD_CMD_SD_APP_SEND_SCR );

        if (errorstatus != SD_OK) {
                return (errorstatus);
        }

        while (!(SDIO ->STA & (SDIO_FLAG_RXOVERR | SDIO_FLAG_DCRCFAIL | SDIO_FLAG_DTIMEOUT | SDIO_FLAG_DBCKEND | SDIO_FLAG_STBITERR))) {
                if (SDIO_GetFlagStatus (SDIO_FLAG_RXDAVL) != RESET) {
                        *(tempscr + index) = SDIO_ReadData ();
                        index++;
                }
        }

        if (SDIO_GetFlagStatus (SDIO_FLAG_DTIMEOUT) != RESET) {
                SDIO_ClearFlag (SDIO_FLAG_DTIMEOUT);
                errorstatus = SD_DATA_TIMEOUT;
                return (errorstatus);
        }
        else if (SDIO_GetFlagStatus (SDIO_FLAG_DCRCFAIL) != RESET) {
                SDIO_ClearFlag (SDIO_FLAG_DCRCFAIL);
                errorstatus = SD_DATA_CRC_FAIL;
                return (errorstatus);
        }
        else if (SDIO_GetFlagStatus (SDIO_FLAG_RXOVERR) != RESET) {
                SDIO_ClearFlag (SDIO_FLAG_RXOVERR);
                errorstatus = SD_RX_OVERRUN;
                return (errorstatus);
        }
        else if (SDIO_GetFlagStatus (SDIO_FLAG_STBITERR) != RESET) {
                SDIO_ClearFlag (SDIO_FLAG_STBITERR);
                errorstatus = SD_START_BIT_ERR;
                return (errorstatus);
        }

        /*!< Clear all the static flags */
        SDIO_ClearFlag (SDIO_STATIC_FLAGS );

        *(pscr + 1) = ((tempscr[0] & SD_0TO7BITS )<< 24)|((tempscr[0] & SD_8TO15BITS )<< 8)|((tempscr[0] & SD_16TO23BITS )>> 8)|((tempscr[0] & SD_24TO31BITS )>> 24);

