MaJerle/stm32f429/00-STM32F429_LIBRARIES/fatfs/drivers/fatfs_sd_sdio.c
        *(pscr) = ((tempscr[1] & SD_0TO7BITS )<< 24)|((tempscr[1] & SD_8TO15BITS )<< 8)|((tempscr[1] & SD_16TO23BITS )>> 8)|((tempscr[1] & SD_24TO31BITS )>> 24);

        return (errorstatus);
}

/**
 * @brief  Converts the number of bytes in power of two and returns the power.
 * @param  NumberOfBytes: number of bytes.
 * @retval None
 */
uint8_t convert_from_bytes_to_power_of_two (uint16_t NumberOfBytes)
{
        uint8_t count = 0;

        while (NumberOfBytes != 1) {
                NumberOfBytes >>= 1;
                count++;
        }
        return (count);
}

/**
 * @brief  Switch mode High-Speed
 * @note   This function must be used after "Transfer State"
 * @note   This operation should be followed by the configuration
 *         of PLL to have SDIOCK clock between 67 and 75 MHz
 * @param  None
 * @retval SD_Error: SD Card Error code.
 */
SD_Error SD_HighSpeed (void)
{
        SD_Error errorstatus = SD_OK;
        uint32_t scr[2] = { 0, 0 };
        uint32_t SD_SPEC = 0;
        uint8_t hs[64] = { 0 };
        uint32_t count = 0, *tempbuff = (uint32_t *) hs;
        TransferError = SD_OK;
        TransferEnd = 0;
        StopCondition = 0;

        SDIO ->DCTRL = 0x0;

        /*!< Get SCR Register */
        errorstatus = FindSCR (RCA, scr);

        if (errorstatus != SD_OK) {
                return (errorstatus);
        }

        /* Test the Version supported by the card*/
        SD_SPEC = (scr[1] & 0x01000000) || (scr[1] & 0x02000000);

        if (SD_SPEC != SD_ALLZERO ) {
                /* Set Block Size for Card */
                SDIO_CmdInitStructure.SDIO_Argument = (uint32_t) 64;
                SDIO_CmdInitStructure.SDIO_CmdIndex = SD_CMD_SET_BLOCKLEN;
                SDIO_CmdInitStructure.SDIO_Response = SDIO_Response_Short;
                SDIO_CmdInitStructure.SDIO_Wait = SDIO_Wait_No;
                SDIO_CmdInitStructure.SDIO_CPSM = SDIO_CPSM_Enable;
                SDIO_SendCommand (&SDIO_CmdInitStructure);
                errorstatus = CmdResp1Error (SD_CMD_SET_BLOCKLEN );
                if (errorstatus != SD_OK) {
                        return (errorstatus);
                }
                SDIO_DataInitStructure.SDIO_DataTimeOut = SD_DATATIMEOUT;
                SDIO_DataInitStructure.SDIO_DataLength = 64;
                SDIO_DataInitStructure.SDIO_DataBlockSize = SDIO_DataBlockSize_64b;
                SDIO_DataInitStructure.SDIO_TransferDir = SDIO_TransferDir_ToSDIO;
                SDIO_DataInitStructure.SDIO_TransferMode = SDIO_TransferMode_Block;
                SDIO_DataInitStructure.SDIO_DPSM = SDIO_DPSM_Enable;
                SDIO_DataConfig (&SDIO_DataInitStructure);

                /*!< Send CMD6 switch mode */
                SDIO_CmdInitStructure.SDIO_Argument = 0x80FFFF01;
                SDIO_CmdInitStructure.SDIO_CmdIndex = SD_CMD_HS_SWITCH;
                SDIO_CmdInitStructure.SDIO_Response = SDIO_Response_Short;
                SDIO_CmdInitStructure.SDIO_Wait = SDIO_Wait_No;
                SDIO_CmdInitStructure.SDIO_CPSM = SDIO_CPSM_Enable;
                SDIO_SendCommand (&SDIO_CmdInitStructure);
                errorstatus = CmdResp1Error (SD_CMD_HS_SWITCH );

                if (errorstatus != SD_OK) {
                        return (errorstatus);
                }
                while (!(SDIO ->STA & (SDIO_FLAG_RXOVERR | SDIO_FLAG_DCRCFAIL | SDIO_FLAG_DTIMEOUT | SDIO_FLAG_DBCKEND | SDIO_FLAG_STBITERR))) {
                        if (SDIO_GetFlagStatus (SDIO_FLAG_RXFIFOHF) != RESET) {
                                for (count = 0; count < 8; count++) {
                                        *(tempbuff + count) = SDIO_ReadData ();
                                }
                                tempbuff += 8;
                        }
                }

                if (SDIO_GetFlagStatus (SDIO_FLAG_DTIMEOUT) != RESET) {
                        SDIO_ClearFlag (SDIO_FLAG_DTIMEOUT);
                        errorstatus = SD_DATA_TIMEOUT;
                        return (errorstatus);
                }
                else if (SDIO_GetFlagStatus (SDIO_FLAG_DCRCFAIL) != RESET) {
                        SDIO_ClearFlag (SDIO_FLAG_DCRCFAIL);
                        errorstatus = SD_DATA_CRC_FAIL;
                        return (errorstatus);
                }
                else if (SDIO_GetFlagStatus (SDIO_FLAG_RXOVERR) != RESET) {
                        SDIO_ClearFlag (SDIO_FLAG_RXOVERR);
                        errorstatus = SD_RX_OVERRUN;
                        return (errorstatus);
                }
                else if (SDIO_GetFlagStatus (SDIO_FLAG_STBITERR) != RESET) {
                        SDIO_ClearFlag (SDIO_FLAG_STBITERR);
                        errorstatus = SD_START_BIT_ERR;
                        return (errorstatus);
                }
                count = SD_DATATIMEOUT;
                while ((SDIO_GetFlagStatus (SDIO_FLAG_RXDAVL) != RESET) && (count > 0)) {
                        *tempbuff = SDIO_ReadData ();
                        tempbuff++;
                        count--;
                }

                /*!< Clear all the static flags */
                SDIO_ClearFlag (SDIO_STATIC_FLAGS );

                /* Test if the switch mode HS is ok */
                if ((hs[13] & 0x2) == 0x2) {
                        errorstatus = SD_OK;
                }
                else {
                        errorstatus = SD_UNSUPPORTED_FEATURE;
                }
        }
        return (errorstatus);
}

/**
 ******************************************************************************
 * @author  MCD Application Team (modified by lukasz.iwaszkiewicz@gmail.com)
 * @version V1.0.3
 * @date    13-November-2013
 * @brief   This file provides
 *            - set of firmware functions to manage Leds, push-button and COM ports
 *            - low level initialization functions for SD card (on SDIO) and EEPROM
 *          available on STM324x9I-EVAL evaluation board(MB1045) RevB from
 *          STMicroelectronics.
 ******************************************************************************
 * @attention
 *
 * <h2><center>&copy; COPYRIGHT 2013 STMicroelectronics</center></h2>
 *
 * Licensed under MCD-ST Liberty SW License Agreement V2, (the "License");
 * You may not use this file except in compliance with the License.
 * You may obtain a copy of the License at:
 *
 *        http://www.st.com/software_license_agreement_liberty_v2
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS,
 * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 *
 ******************************************************************************
 */

/**
 * @brief  DeInitializes the SDIO interface.
 * @param  None
 * @retval None
 */
void SD_LowLevel_DeInit (void)
{
        GPIO_InitTypeDef GPIO_InitStructure;

        /*!< Disable SDIO Clock */
        SDIO_ClockCmd (DISABLE);

        /*!< Set Power State to OFF */
        SDIO_SetPowerState (SDIO_PowerState_OFF);

        /*!< DeInitializes the SDIO peripheral */
        SDIO_DeInit ();

        /* Disable the SDIO APB2 Clock */
        RCC_APB2PeriphClockCmd (RCC_APB2Periph_SDIO, DISABLE);

